In [1]:
import pandas as pd

In [4]:
lista = list(range(1,11))

In [5]:
lista

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [6]:
tuple1 = tuple(lista)

In [7]:
tuple1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [8]:
set1 = set(lista)
set1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [10]:
index = ['a','b','c','d','e','f','g','h','i','j']
pd.Series(lista, index = index)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [11]:
pd.Series(tuple1, index = index)

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [12]:
pd.Series(set1, index = index)

TypeError: 'set' type is unordered

In [13]:
dict1 = {
    'Ajay' : 'Kumar',
    "Swaraj" : "Badehi",
    'Disha' : 'Gautam'
}

dict1

{'Ajay': 'Kumar', 'Swaraj': 'Badehi', 'Disha': 'Gautam'}

In [14]:
pd.Series(dict1)

Ajay       Kumar
Swaraj    Badehi
Disha     Gautam
dtype: object

# 3

In [30]:
series = pd.Series(range(1,11))
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [16]:
list(series)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [17]:
tuple(series)

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [18]:
set(series)

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [19]:
dict(series)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

# 4

In [42]:
series2 = series
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [21]:
series2[:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [22]:
series2[-5:]

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [23]:
# series2[5]=50               This will replace the previos value at index 5
series2

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [43]:
temp = list(series2)
temp.insert(5, 50)
series2 = pd.Series(temp)
series2

0      1
1      2
2      3
3      4
4      5
5     50
6      6
7      7
8      8
9      9
10    10
dtype: int64

In [44]:
# series2[10] = 100
series2.iloc[10] =  100

In [38]:
series2

0       1
1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [45]:
series2 = series2.drop(0)
series2

1       2
2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [49]:
series3 = series2
series3.pop(1)

2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

# 5

In [51]:
for i in series2:
    if i == 100:
        print("Element : ", i)

3
4
5
50
6
7
8
9
100
Element :  100

In [63]:
for i in range(2,len(series2)+2):
    if series2[i] == 100:
        print(i, series2[i])

10 100

In [64]:
series2

2       3
3       4
4       5
5      50
6       6
7       7
8       8
9       9
10    100
dtype: int64

In [65]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])
pd.concat([series_A, series_B])

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [66]:
pd.concat([series_A, series_B], ignore_index=True)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# 7

In [68]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
Sample

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [69]:
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [76]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]
dataframe = pd.DataFrame(List, index = ['a','b','c'])
dataframe

    0   1   2
a  AA  BB  CC
b  DD  EE  FF
c  GG  HH  II

In [72]:
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}
dataframe2 = pd.DataFrame(Dictionary)
dataframe2

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

In [77]:
Dictionary = { 'Names': ['Jordan', 'Ajay', 'Mohit', 'Tushar', 'Jayradha'],'Age': [34, 23, 22, 20, 21]}
dataframe2 = pd.DataFrame(Dictionary)
dataframe2

      Names  Age
0    Jordan   34
1      Ajay   23
2     Mohit   22
3    Tushar   20
4  Jayradha   21

In [80]:
dataframe2.iloc[2,1]

22

In [81]:
dataframe2.iloc[2,0]

'Mohit'

In [82]:
dataframe2.iloc[2:,:]

      Names  Age
2     Mohit   22
3    Tushar   20
4  Jayradha   21

In [83]:
dataframe2.iloc[:,:]

      Names  Age
0    Jordan   34
1      Ajay   23
2     Mohit   22
3    Tushar   20
4  Jayradha   21

In [85]:
dataframe2.iloc[:3, :]

    Names  Age
0  Jordan   34
1    Ajay   23
2   Mohit   22

In [88]:
dataframe2[dataframe2['Age'] > 21]

    Names  Age
0  Jordan   34
1    Ajay   23
2   Mohit   22

In [94]:
dataframe2.loc[len(dataframe2.index)] = ['Sita', 35]

In [95]:
dataframe2

      Names  Age
0    Jordan   34
1      Ajay   23
2     Mohit   22
3    Tushar   20
4  Jayradha   21
5      Sita   35

In [97]:
dataframe2.iloc[4,0] = 'John'
dataframe2.iloc[4,1] = 56

dataframe2

    Names  Age
0  Jordan   34
1    Ajay   23
2   Mohit   22
3  Tushar   20
4    John   56
5    Sita   35

In [98]:
dataframe2.iloc[4,0] =

'John'

In [99]:
dataframe2.drop(0)

    Names  Age
1    Ajay   23
2   Mohit   22
3  Tushar   20
4    John   56
5    Sita   35

In [104]:
dataframe3=list(dataframe2)
dataframe3

['Names', 'Age']

In [108]:
dataframe2.values

array([['Jordan', 34],
       ['Ajay', 23],
       ['Mohit', 22],
       ['Tushar', 20],
       ['John', 56],
       ['Sita', 35]], dtype=object)

In [211]:
l1 = list(dataframe2.values)
print(l1)

[array(['Jordan', 34], dtype=object), array(['Ajay', 23], dtype=object), array(['Mohit', 22], dtype=object), array(['Tushar', 20], dtype=object), array(['John', 56], dtype=object), array(['Sita', 35], dtype=object)]

In [213]:
final_list = []
for i in range(len(l1)):
    final_list.append(l1[i][0])
final_list

['Jordan', 'Ajay', 'Mohit', 'Tushar', 'John', 'Sita']

In [121]:
dataframe2.values.tolist()

[['Jordan', 34],
 ['Ajay', 23],
 ['Mohit', 22],
 ['Tushar', 20],
 ['John', 56],
 ['Sita', 35]]

In [128]:
l1 = dict(dataframe2.values)
print(l1)

{'Jordan': 34, 'Ajay': 23, 'Mohit': 22, 'Tushar': 20, 'John': 56, 'Sita': 35}

In [125]:
A = pd.DataFrame([1,2,3,4,5])
B = pd.DataFrame([11,12,13,14,15])

In [126]:
A

   0
0  1
1  2
2  3
3  4
4  5

In [127]:
B

    0
0  11
1  12
2  13
3  14
4  15

In [133]:
C = pd.concat([A,B], ignore_index=True)
C

    0
0   1
1   2
2   3
3   4
4   5
5  11
6  12
7  13
8  14
9  15

In [135]:
AA = C.iloc[:5, :]
AA

   0
0  1
1  2
2  3
3  4
4  5

In [198]:
BB = C.iloc[5:, :]
BB

    0
5  11
6  12
7  13
8  14
9  15

In [199]:
BB = BB.reset_index(drop=True)
BB

    0
0  11
1  12
2  13
3  14
4  15

In [197]:
BB = pd.DataFrame(BB[0])
BB

    0
0  11
1  12
2  13
3  14
4  15

In [200]:
dataframe2

    Names  Age
0  Jordan   34
1    Ajay   23
2   Mohit   22
3  Tushar   20
4    John   56
5    Sita   35

In [204]:
dataframe2[dataframe2['Age'] == 20]

    Names  Age
3  Tushar   20

In [206]:
for i,j in dataframe2.values:
    if j == 20:
        print(i)

Tushar

In [207]:
dataframe2.sort_values (by = 'Age')

    Names  Age
3  Tushar   20
2   Mohit   22
1    Ajay   23
0  Jordan   34
5    Sita   35
4    John   56

In [217]:
final_list = []
for i in range(len(l1)):
    final_list.append(l1[i][1])
set(final_list)

{20, 22, 23, 34, 35, 56}

In [219]:
dataframe2.iloc[:, :1]

    Names
0  Jordan
1    Ajay
2   Mohit
3  Tushar
4    John
5    Sita